[MachinePistol_CV X2WeaponTemplate]
FriendlyName="Machine Pistol"
FriendlyNamePlural="Machine Pistols"
BriefSummary="A pistol that has been modified to fire multiple rounds in rapid succession."
TacticalText="<Bullet/> A secondary weapon with mediocore range and power, but deadly firing speed.<br/><Bullet/> Fires three shots with each trigger pull without upgrades.<br/>"
AbilityDescName="Machine Pistol"

[MachinePistol_MG X2WeaponTemplate]
FriendlyName="Gauss Repeater"
FriendlyNamePlural="Gauss Repeaters"
BriefSummary="A pistol that has been modified to fire multiple rounds in rapid succession at exceptional speeds, thanks to a built-in magnetic accelerator."
TacticalText="<Bullet/> A secondary weapon with mediocore range and power, but deadly firing speed.<br/><Bullet/> Fires three shots with each trigger pull without upgrades.<br/>"
AbilityDescName="Gauss Repeater"

[MachinePistol_BM X2WeaponTemplate]
FriendlyName="Beam Uzi"
FriendlyNamePlural="Beam Uzis"
BriefSummary="A pistol that has been modified to fire plasma volleys in rapid succession."
TacticalText="<Bullet/> A secondary weapon with mediocore range and power, but deadly firing speed.<br/><Bullet/> Fires three shots with each trigger pull without upgrades.<br/>"
AbilityDescName="Beam Uzi"

[FW_FireMachinePistol X2AbilityTemplate]
LocFriendlyName="Fire Machine Pistol"
LocFlyOverText="Fire Machine Pistol"
LocLongDescription="Fire 3 shots at a target with your secondary weapon."
LocHelpText="Fire 3 shots at a target with your secondary weapon."
LocPromotionPopupText="<Bullet/> Fire 3 shots at a target with your secondary weapon.<br/>"

[FW_MachineSpray X2AbilityTemplate]
LocFriendlyName="Fire Machine Pistol"
LocFlyOverText="Fire Machine Pistol"
LocLongDescription="Fire 4 shots at a target with your secondary weapon."
LocHelpText="Fire 4 shots at a target with your secondary weapon."
LocPromotionPopupText="<Bullet/> Fire 4 shots at a target with your secondary weapon.<br/>"

[FW_Yellowjacket X2AbilityTemplate]
LocFriendlyName="Yellowjacket"
LocFlyOverText="Yellowjacket"
LocLongDescription="Shots fired by your machine pistol now ignore armor."
LocHelpText="Shots fired by your machine pistol now ignore armor."
LocPromotionPopupText="<Bullet/> Shots fired by your machine pistol now ignore armor.<br/>"

[FW_HeavyRounds X2AbilityTemplate]
LocFriendlyName="Heavy Rounds"
LocFlyOverText="Heavy Rounds"
LocLongDescription="Shots fired by your machine pistol now deal 1 additional damage."
LocHelpText="Shots fired by your machine pistol now deal 1 additional damage."
LocPromotionPopupText="<Bullet/> Shots fired by your machine pistol now deal 1 additional damage.<br/>"

[FW_SnapShotDamagePenalty X2AbilityTemplate]
LocFriendlyName="Snap Shot Damage Penalty"
LocFlyOverText="Snap Shot Damage Penalty"
LocLongDescription="Your sniper rifle shots now deal slightly less damage."
LocHelpText="Your sniper rifle shots now deal slightly less damage."
LocPromotionPopupText="<Bullet/> Your sniper rifle shots now deal slightly less damage.<br/>"

[FW_Test_MachinePistol X2SoldierClassTemplate]
DisplayName="FW_Test_MachinePistol"
ClassSummary="FW_Test_MachinePistol."
LeftAbilityTreeTitle="SAW Gunner"
RightAbilityTreeTitle="Machinegunner"